app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-06-07 18:12:32.672448"], ["updated_at", "2018-06-07 18:12:32.672448"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-06-07 18:12:32.677602"], ["updated_at", "2018-06-07 18:12:32.677602"]]
---
  def upload
    #binding.pry
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])